<?php

namespace render\documents;

use render\defaultBuild\BaseRenderBuilder;

class Privacy extends BaseRenderBuilder
{
    public function defaultParams()
    {   
        return [
            'cookie' => []
        ];
    }
    public function build()
    {
        return '
            <h1>Політика конфіденційності</h1>
            <ol>
                <li>
                    <b>Які дані користувача ми використовуємо</b>
                    <div><p>Для повноцінного користування додатком потрібно усього дві речі: адреса електронної пошти та приблизне місцезнаходження користувача.</p>
            <p>Адреса електронної пошти використовується для аутентифікації користувача та інформування (наприклад зміни у цій Політиці конфіденційності. Адреса електронної пошти зберігається у базі даних</p>
            <p>Геолокація використовується ВИКЛЮЧНО для того, щоб прорахувати, які магазини знаходяться поруч, щоб надати користувачу актуальний список доступних товарів та ціни для них. Дані про геолокацію не зберігаються ніде, вони лише присутні при обчисленнях. Ви можете не надавати дозвіл на використання геолокації, але тоді список товарів буде неактуальний або відсутній. Крім того ми використовуємо лише приблизну геолокацію, не уточнюючи її будь-яким чином.</p>
            <p>Жодні з цих даних не передаються третім особам, ніколи не будуть їм передаватись та є надійно захищенними. Усі запити до сервера захищені SSL-шифруванням.</p>
                        <p>Примітка. Кошик, що сформував користувач зберігається лише на пристрої користувача.</p>
                    </div>
                </li>
                <li>
                    <b>GDPR (видалення даних про користувача)</b>
                    <div>
                        <p>Дані користувача не можна завантажити. Їх можна лише видалити. Ці дані - це унікальний ідентифікатор користувача, унікальне ім\'я користувача, адреса електронної пошти, пароль у зашифрованому вигляді (криптошифрування)</p>
                <p>Для видалення даних напишіть на лист на пошту info@arxalex.co з пошти, яку ви використовували при реєстрації та опишіть прохання про видалення у довільній формі. Протяго 5-ти робочих днів дані будуть видалені, а у відповідь на лист прийде підтвердження. Операцію не можна відмінити.</p>
                    </div>
                </li>
            </ol>';
    }
}
